EventSamples/ALERT.MLSensor.MailNew/mailman-events-00010.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <soap:Header>Header</soap:Header>
  <soap:Body>
    <wsnt:Notify>
      <wsnt:NotificationMessage>
        <wsnt:Topic>ALERT.MLSensor.MailNew</wsnt:Topic>
        <wsnt:ProducerReference>
          <wsa:Address>http://www.alert-project.eu/MLSensor</wsa:Address>
        </wsnt:ProducerReference>
        <wsnt:Message>
          <ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:sm="http://www.alert-project.eu/stardom" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:sc="http://www.alert-project.eu/socrates" xmlns:p="http://www.alert-project.eu/panteon" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd"  >
            <ns1:head>
              <ns1:sender>MLSensor</ns1:sender>
              <ns1:timestamp>1348472809845</ns1:timestamp>
              <ns1:sequencenumber>9</ns1:sequencenumber>
            </ns1:head>
            <ns1:payload>
              <ns1:meta>
                <ns1:startTime>1348472809845</ns1:startTime>
                <ns1:endTime>1348472809846</ns1:endTime>
                <ns1:eventName>ALERT.MLSensor.MailNew</ns1:eventName>
                <ns1:eventId>9</ns1:eventId>
                <ns1:eventType>Request</ns1:eventType>
              </ns1:meta>
              <ns1:eventData>
                <r1:message>
                  <r1:from><![CDATA[ervin at kde.org (Kevin Ottens)]]></r1:from>
                  <r1:date>Thu, 05 Jan 2006 11:51:48 +0200</r1:date>
                  <r1:subject><![CDATA[[Kde-hardware-devel] Solid Knowledge Base]]></r1:subject>
                  <r1:content><![CDATA[Le Jeudi 5 Janvier 2006 06:24, Nicholas Kaye-Smith a ?crit :
> I am interested in helping the development the Solid Knowledge Base. I know
> PHP - though I have not worked in Object-Oriented PHP before, I know other
> O-O languages, such as basic C++, and know the theory behind O-O.
> How would I get involved?

Currently the knowledge base is more or less in standby. I'd say we need at 
least one person with strong knowledge in web application designing.

That said, I think that a small team of motivated people could design 
something really interesting.

Currently I'd like to see some discussions about more detailed features we 
could provide to the user, I've some ideas myself, but I guess we can come up 
with more. Hm, that really show the need of a wiki again... I'll see with the 
people hosting the website what can be done, I'll come back to the list when 
we'll have something in place.

Regards.
-- 
K?vin 'ervin' Ottens, http://ervin.ipsquad.net
"Ni le ma?tre sans disciple, Ni le disciple sans ma?tre,
Ne font reculer l'ignorance."
]]></r1:content>
                </r1:message>
              </ns1:eventData>
            </ns1:payload>
          </ns1:event>
        </wsnt:Message>
      </wsnt:NotificationMessage>
    </wsnt:Notify>
  </soap:Body>
</soap:Envelope>